Revit 2027 API
LinkedResourceOpenedEventArgs.LinkedResourcePathName Property
 Path of the linked resource.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string LinkedResourcePathName { get; }
Public ReadOnly Property LinkedResourcePathName As String
	Get
public:
property String^ LinkedResourcePathName {
	String^ get ();
}
member LinkedResourcePathName : string with get
Property Value
String
See Also
Reference
LinkedResourceOpenedEventArgs Class
Autodesk.Revit.DB.Events Namespace